python/04.string.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-09 Sat 21:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>字符串</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">字符串</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd966ff9">1. 基本操作</a></li>
<li><a href="#org8fe5179">2. 模板字符串</a></li>
<li><a href="#org350888c">3. 成员函数</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgd966ff9" class="outline-2">
<h2 id="orgd966ff9"><span class="section-number-2">1</span> 基本操作</h2>
<div class="outline-text-2" id="text-1">
<p>
字符串有类似于列表的索引操作，也可以使用 <code>%</code> 和元组的组合方式来输出格式化字符串。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">url</span> = <span style="color: #2aa198;">'http://jeanhwea.github.io'</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>url<span style="color: #d8241f;">[</span>-2:<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">fmt</span> = <span style="color: #2aa198;">'first: %s, second: %s'</span>
<span style="color: #6c71c4;">val</span> = <span style="color: #8d5649;">(</span><span style="color: #2aa198;">'hello'</span>, <span style="color: #2aa198;">'Jeanhwea'</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>fmt % val<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
io
first: hello, second: Jeanhwea

</pre>
</div>
</div>


<div id="outline-container-org8fe5179" class="outline-2">
<h2 id="org8fe5179"><span class="section-number-2">2</span> 模板字符串</h2>
<div class="outline-text-2" id="text-2">
<p>
Python 支持字符串模板的操作，但是并没有 Ruby 那么好用，一般的操作方式如下：
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">from</span> string <span style="color: #859900;">import</span> Template
<span style="color: #6c71c4;">s</span> = Template<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'$friut is $color'</span><span style="color: #8d5649;">)</span> <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">using $$ to diplay $</span>
<span style="color: #6c71c4;">data</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'friut'</span>: <span style="color: #2aa198;">'apple'</span>, <span style="color: #2aa198;">'color'</span>: <span style="color: #2aa198;">'red'</span><span style="color: #8d5649;">}</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>s.substitute<span style="color: #d8241f;">(</span>friut=<span style="color: #2aa198;">'banana'</span>, color=<span style="color: #2aa198;">'yellow'</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>s.substitute<span style="color: #d8241f;">(</span>data<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
banana is yellow
apple is red

</pre>

<p>
另外一直比较常用的模板字符串形式如下，操作清晰易懂，建议使用这种方式来操作字符串。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">foo</span> = <span style="color: #2aa198;">'foo'</span>
<span style="color: #6c71c4;">bar</span> = <span style="color: #2aa198;">'bar'</span>

<span style="color: #6c71c4;">foobar</span> = <span style="color: #2aa198;">'%s%s'</span> % <span style="color: #8d5649;">(</span>foo, bar<span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">foobar</span> = <span style="color: #2aa198;">'{0}{1}'</span>.<span style="color: #6c71c4;">format</span><span style="color: #8d5649;">(</span>foo, bar<span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">foobar</span> = <span style="color: #2aa198;">'{foo}{bar}'</span>.<span style="color: #6c71c4;">format</span><span style="color: #8d5649;">(</span>foo=foo, bar=bar<span style="color: #8d5649;">)</span>

<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>foobar<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
foobar

</pre>
</div>
</div>


<div id="outline-container-org350888c" class="outline-2">
<h2 id="org350888c"><span class="section-number-2">3</span> 成员函数</h2>
<div class="outline-text-2" id="text-3">
<p>
字符串索引方式。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #586e75; font-style: italic;">#  </span><span style="color: #586e75; font-style: italic;">+---+---+---+---+---+---+</span>
<span style="color: #586e75; font-style: italic;">#  </span><span style="color: #586e75; font-style: italic;">| P | y | t | h | o | n |</span>
<span style="color: #586e75; font-style: italic;">#  </span><span style="color: #586e75; font-style: italic;">+---+---+---+---+---+---+</span>
<span style="color: #586e75; font-style: italic;">#  </span><span style="color: #586e75; font-style: italic;">0   1   2   3   4   5   6</span>
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">-6  -5  -4  -3  -2  -1</span>
<span style="color: #6c71c4;">python</span> = <span style="color: #2aa198;">'Python'</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>python<span style="color: #d8241f;">[</span>0<span style="color: #d8241f;">]</span>, python<span style="color: #d8241f;">[</span>1<span style="color: #d8241f;">]</span>, python<span style="color: #d8241f;">[</span>2<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>python<span style="color: #d8241f;">[</span>-1<span style="color: #d8241f;">]</span>, python<span style="color: #d8241f;">[</span>-2<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
P y t
n o

</pre>

<p>
<code>find</code> 查找字符串的内容
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">url</span> = <span style="color: #2aa198;">'http://jeanhwea.github.io'</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>url.find<span style="color: #d8241f;">(</span><span style="color: #2aa198;">'jeanhwea'</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>url.find<span style="color: #d8241f;">(</span><span style="color: #2aa198;">'nothing'</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">start</span> = 10
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>url.find<span style="color: #d8241f;">(</span><span style="color: #2aa198;">'e'</span>, start<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
7
-1
13

</pre>

<p>
<code>join</code> 连接字符串
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">dirs</span> = <span style="color: #2aa198;">'home'</span> , <span style="color: #2aa198;">'hujh'</span>, <span style="color: #2aa198;">'Projects'</span> <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">tuple</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">'/'</span>.join<span style="color: #d8241f;">(</span>dirs<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">seq</span> = <span style="color: #8d5649;">[</span>1, 3, 4<span style="color: #8d5649;">]</span> <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">list</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">'+'</span>.join<span style="color: #d8241f;">(</span><span style="color: #9564bf;">[</span><span style="color: #6c71c4;">str</span><span style="color: #24a222;">(</span>n<span style="color: #24a222;">)</span> <span style="color: #859900;">for</span> n <span style="color: #859900;">in</span> seq<span style="color: #9564bf;">]</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
home/hujh/Projects
1+3+4

</pre>

<p>
<code>split</code> 分割字符串
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">nums</span> = <span style="color: #2aa198;">'1+3+2+3+2'</span>.split<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'+'</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>nums<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
['1', '3', '2', '3', '2']

</pre>

<p>
<code>strip</code> 可以移除字符串前后的空白字符，另外有 <code>lstrip</code> 和 <code>rstrip</code> 。其它一些转化
大小写的函数见代码演示。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">foo</span> = <span style="color: #2aa198;">'   internal whitespace is kept    '</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>foo.strip<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>foo.lstrip<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>foo.rstrip<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>

<span style="color: #6c71c4;">sentence</span> = <span style="color: #2aa198;">'My name is Jack'</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>sentence.lower<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>

<span style="color: #6c71c4;">title</span> = sentence.replace<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'name'</span>, <span style="color: #2aa198;">'first name'</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>title.capitalize<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>

<span style="color: #859900;">from</span> string <span style="color: #859900;">import</span> capwords
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>capwords<span style="color: #d8241f;">(</span>title<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
internal whitespace is kept
internal whitespace is kept
   internal whitespace is kept
my name is jack
My first name is jack
My First Name Is Jack

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-23 Tue 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-02-09 Sat 21:45</p>
</div>
</body>
</html>
